#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_caller_identity.current: Reading...
data.aws_vpc.vpc: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=775011538559]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-06b23cf4a5b4fe14a]
data.aws_security_group.sg: Reading...
data.aws_subnets.subnets: Reading...
data.aws_security_group.sg: Read complete after 0s [id=sg-0f0d8e98452b8f40f]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access will be created
  + resource "aws_eks_access_entry" "access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "gabscluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "group-1",
          + "group-2",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::775011538559:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.policy will be created
  + resource "aws_eks_access_policy_association" "policy" {
      + associated_at = (known after apply)
      + cluster_name  = "gabscluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::775011538559:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "gabscluster"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::775011538559:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-0f0d8e98452b8f40f",
            ]
          + subnet_ids                = [
              + "subnet-006e060e1202e586b",
              + "subnet-0189b42a71bdf65b2",
              + "subnet-0991092a05fcf3084",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "gabscluster"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "gabsnode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::775011538559:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-006e060e1202e586b",
          + "subnet-0189b42a71bdf65b2",
          + "subnet-0991092a05fcf3084",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 5
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster-endpoint          = (known after apply)
  + cluster-name              = "gabscluster"
  + cluster-security-group-id = (known after apply)
  + lab_role_arn              = "arn:aws:iam::775011538559:role/LabRole"
  + principal_role_arn        = "arn:aws:iam::775011538559:role/voclabs"
  + region                    = "us-east-1"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @gabrielmirandat, Action: `pull_request`*